ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/esb_setPromotionalSale_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.ebay">
	<soapenv:Header></soapenv:Header>
	<soapenv:Body>
		<urn:apiUrl>%s(tradingApiUrl)</urn:apiUrl>
		<urn:appId>%s(appId)</urn:appId>
		<urn:version>%s(version)</urn:version>
		<urn:routing>%s(routing)</urn:routing>
		<urn:siteId>%s(siteId)</urn:siteId>
		<urn:authToken>%s(authToken)</urn:authToken>
		<urn:action>INVALID</urn:action>
		<urn:promotionalSaleDetails xmlns:ebl="urn:ebay:apis:eBLBaseComponents">
			<ebl:values>
				<ebl:PromotionalSaleID>1112</ebl:PromotionalSaleID>
				<ebl:PromotionalSaleName>Promotional Name</ebl:PromotionalSaleName>
				<ebl:DiscountType>Percentage</ebl:DiscountType>
				<ebl:DiscountValue>10</ebl:DiscountValue>
				<ebl:PromotionalSaleStartTime>%s(PromotionalSaleStartTime)</ebl:PromotionalSaleStartTime>
				<ebl:PromotionalSaleEndTime>%s(PromotionalSaleEndTime)</ebl:PromotionalSaleEndTime>
				<ebl:PromotionalSaleType>PriceDiscountOnly</ebl:PromotionalSaleType>
			</ebl:values>
		</urn:promotionalSaleDetails>
		<!-- Send Connector method name to be called -->
		<urn:method>setPromotionalSale</urn:method>
	</soapenv:Body>
</soapenv:Envelope>
